src/main/resources/xml/accommodationSalesServicePort/refundVirtualContractPoints/refundVirtualContractPoints.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sal="http://sales.accommodation.transferobject.booking.dreams.wdw.com">
   <soapenv:Header/>
   <soapenv:Body>
      <sal:refundVirtualContractPoints>
         <refundOTUPRequest>
            <!--1 or more repetitions:-->
            <externalReference>
               <name>?</name>
               <value>?</value>
            </externalReference>
            <refundType>?</refundType>
            <travelComponentId>?</travelComponentId>
            <pointsToRefund>?</pointsToRefund>
            <dollarAmountRefund>?</dollarAmountRefund>
         </refundOTUPRequest>
         <serviceContext>
            <addressRole>?</addressRole>
            <conversationId>?</conversationId>
            <messageId>?</messageId>
            <party1Id>?</party1Id>
            <party1Type>?</party1Type>
            <party2Id>?</party2Id>
            <party2Type>?</party2Type>
            <pathHostName>?</pathHostName>
            <pathId>?</pathId>
            <principalId>?</principalId>
            <principalMethod>?</principalMethod>
            <principalRole>?</principalRole>
            <principalUri>?</principalUri>
            <principalValue>?</principalValue>
            <requestTimeStamp>?</requestTimeStamp>
            <toAddressRole>?</toAddressRole>
            <userName>?</userName>
         </serviceContext>
      </sal:refundVirtualContractPoints>
   </soapenv:Body>
</soapenv:Envelope>
